GoJunket/app/controllers/search_controller.rb

  def create
    @search = Search.new(params[:search])
    if @search.save
---
INSERT INTO "searches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-10-02 09:13:14.770235"], ["updated_at", "2015-10-02 09:13:14.770235"]]