GoJunket/app/controllers/users_controller.rb

  def show
    @user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (name LIKE '%jennifer%')