GoJunket/app/controllers/users/registrations_controller.rb

SELECT "interests".* FROM "interests" INNER JOIN "interests_users" ON "interests"."id" = "interests_users"."interest_id" WHERE "interests_users"."user_id" = ?  [["user_id", 3]]
UPDATE "users" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar_file_name", "Jennifer-02.jpg"], ["avatar_file_size", 102406], ["avatar_updated_at", "2015-10-02 10:36:31.369722"], ["updated_at", "2015-10-02 10:36:31.514948"], ["id", 1]]
---
  def update
    interest_id = params[:user][:interests_ids]
    current_user.interests.push(Interest.find(interest_id))