GoJunket/app/views/users/registrations/edit.html.erb

SELECT "interests".* FROM "interests"
SELECT "interests".* FROM "interests" INNER JOIN "interests_users" ON "interests"."id" = "interests_users"."interest_id" WHERE "interests_users"."user_id" = ?  [["user_id", 3]]
---
 <div>What are you interested in?<br>
 <% Interest.all.each do |int| %>
 <%= check_box_tag "user_interests_ids_#{int.id}", int.id, (f.object.interests.present? && f.object.interests.include?(int.id)), {:name => "user[interests_ids][]"} %>