GoJunket/app/views/users/show.html.erb

SELECT "interests".* FROM "interests" INNER JOIN "interests_users" ON "interests"."id" = "interests_users"."interest_id" WHERE "interests_users"."user_id" = ?  [["user_id", 1]]
---

<p>Interests:<% @user.interests.each do |int| %><br>